README.org
#+TITLE: 0 to LSP: Emacs init.el From Scratch
#+AUTHOR: Xavier Capaldi
#+PROPERTY: header-args  :tangle "init.el"

* Inspiration
[[https://github.com/ThePrimeagen][ThePrimeagen]] created a [[https://www.youtube.com/watch?v=w7i4amO_zaE][YouTube video]] detailing his process of going from a vanilla NeoVim install to a fully configured minimal editor with LSP.
The video seems popular and since its release I've seen several others in a similar vein.
However all the videos are targetted at Vim or NeoVim.
I wanted to create a similar guide for new Emacs users.
I think Emacs is a wonderful editor but it is so extensible that one user's config may be unreadable to another.
The goal of this repository is to create a basic configuration guide that somewhat mimics the basic functionality in ThePrimeagen's video or in Visual Studio Code.
If you're curious, why emacs, I recommend the [[https://github.com/remacs/remacs#why-emacs][remacs readme]] which explains it quite well.
For me, the killer feature of Emacs is not a particular package (org-mode, magit) but rather the fact that the entire system is hackable.
You, as the user, feel empowered to modify the system to your needs.
I hope to show that you can replicate basic features of a modern editor with a minimal configuration.
The small time spent configuring Emacs will pay off in the long run; the editor has already survived nearly 40 years!

* Why version 29
This guide was written using and for Emacs v29.1.
It will probably work well with any version >v29.
v29 introduced [[https://github.com/joaotavora/eglot][eglot]] as its native LSP client; making it the first version for which I could write this guide without using external libraries.

* Why not a literate config
If you already know Emacs, you may wonder why I don't suggest a literate configuration using org-mode.
In fact this document could be used as a literate configuration with very little modification.
The main reason I don't suggest this is that it is another layer of complexity for a new user.
Already learning the basics of Emacs and elisp is enough without adding org-mode or the tangling logic.
You can always add it later.

* Pure vanilla vs. with packages
This guide is split into two but described in one cohesive narrative.
The first part of the guide uses *only* pure vanilla Emacs.
No external packages are installed.
This version of the config is tangled into =vanilla-init.el=.
While is it functional, I don't think this configuration can compete with the user experience of Visual Studio Code.
For that reason, in the second part of guide, we go back and amend the configuration using external packages to improve the experience greatly.
That config is tangled to =init.el=.
If you want a super minimalistic system that runs on Linux, you could try the =vanilla-init.el=.
However if you want something more modern and functional (or you use MacOS) I strongly recommend the =init.el=.
=vanilla-init.el= is less than 100 loc and =init.el= is less than 200 loc.
In either case, it's not too bad for such a complex and capable editor.

* Read the manual
This guide doesn't go into a lot of detail as to how much Emacs or these packages can be configured.
Nor does it give a tutorial on the basic usage of Emacs itself.
I have included links to the relevant resource for every package.
Feel free to use the config as is, but I do recommend reading the documentation.
Emacs doesn't hold your hand but the documentation is readily available in the editor itself.

* Alternative motion schemes
If you're trying Emacs after working in a vim-like editor, you may be tempted to use [[https://github.com/emacs-evil/evil][evil]] which is a vim emulation package in Emacs.
It's an excellent emulation but requires a lot of modification to make it work nicely with Emacs' countless modes.
Instead I suggest you try vanilla Emacs at first.
If you're really set on a modal editing environment, look at [[https://github.com/meow-edit/meow][meow]] which is a selection-based modal editing mode inspired by [[https://kakoune.org/][kakaoune]].
It works nicely with the Emacs built-ins.

* Configuration location
The Emacs configuration should be stored in your XDG-compatible config directory: =~/.config/emacs/=.
Alternatively you can use =~/.emacs.d/= or any of [[https://www.gnu.org/software/emacs/manual/html_node/emacs/Init-File.html][several other locations]].
The location on Windows can be determined by [[https://www.gnu.org/software/emacs/manual/html_node/efaq-w32/Location-of-init-file.html#Location-of-init-file][following this FAQ]].
You just need an =init.el= as your main configuration.
You could split your configuration into many files and ~require~ them in your central config but at this point, you don't need that complexity.
The whole configuration detailed here is less than 150 lines.
Note that you should follow the [[https://www.gnu.org/software/emacs/manual/html_node/elisp/Key-Binding-Conventions.html][keybinding conventions]] when adding your own keybindings to this configuration.

* The vanilla experience
** Package configuration manager
Emacs comes with [[https://github.com/jwiegley/use-package][use-package]] which is an excellent package configuration manager.
It allows you to modularize your configuration by package; controlling when packages, keybindings and settings are loaded.
It does all this without requiring you to have extensive elisp knowledge.
First we need to load the package manually:

#+BEGIN_SRC emacs-lisp
(require 'use-package)
#+END_SRC

** General settings
Emacs default settings are ... old.
We can apply some general settings that will make your initial experience more modern.
Note that for most of these we could configure them inside a =use-package= block scoped to the native package.
However for many of these, that would be the only setting we apply, so it seems unnecessarily verbose.
For example if we want Emacs to respect the system clipboard for purposes of cutting and pasting we could configure it like this:

#+BEGIN_SRC emacs-lisp :tangle no
(use-package select
  :ensure nil
  :custom (select-enable-clipboard t))
#+END_SRC

Or we can apply a bunch of these small settings in a generic =emacs= block
using one line per setting:

#+BEGIN_SRC emacs-lisp :tangle vanilla-init.el :noweb yes
(use-package emacs
  :config
  <<SET_DEFAULTS>>
  <<SET_GLOBAL_MODES>>
  <<LOAD_THEME>>
  <<SET_FONT>>
  <<REBIND_KEYS>>
  <<BACKUPS_AND_AUTOSAVES>>)
#+END_SRC

Here are a bunch of good defaults to put in that =config= block:

#+BEGIN_SRC emacs-lisp :tangle no :noweb-ref SET_DEFAULTS
(setq-default
 coding-system-for-read 'utf-8     ; Use UTF-8 by default
 coding-system-for-write 'utf-8
 cursor-in-non-selected-windows t  ; Don't hide the cursor in inactive windows
 help-window-select t              ; Focus new help windows when opened
 indent-tabs-mode nil              ; Use spaces by default instead of tabs
 tab-width 4                       ; Set width for tabs
 indicate-empty-lines t            ; Display bitmap in left fringe on empty lines
 indicate-buffer-boundaries 'left  ; Indicate last newline in buffer
 require-final-newline t           ; Always insert final newline on save
 show-trailing-whitespace t        ; Highlight trailing whitespace at end of line
 inhibit-startup-screen t          ; Remove default start screen
 select-enable-clipboard t         ; Merge Emacs and system clipboard
 view-read-only t                  ; Always open read-only buffers in view-mode
 visible-bell t                    ; Use a visual bell
 vc-follow-symlinks t              ; Don't ask for confirmation following symlinked files
 sentence-end-double-space nil     ; Sentences end with punctuation and a single space
 show-paren-delay 0)               ; No delay on highlighting matching paren
(fset 'yes-or-no-p 'y-or-n-p)  ; Replace yes/no prompts with y/n
#+END_SRC

We should also enable/disable some of the global modes.
You'll notice I leave =tool-bar-mode= and =menu-bar-mode= enabled; two modes which people often recommend disabling for a cleaner interface.
However if you're just starting out in Emacs, I don't think there is anything wrong with using these menus.
You can easily adjust these settings as you see fit.

#+BEGIN_SRC emacs-lisp :tangle no :noweb-ref SET_GLOBAL_MODES
(column-number-mode 1)                   ; Show the column number in modeline
(tool-bar-mode 1)                        ; Show the toolbar
(menu-bar-mode 1)                        ; Show the menubar
(context-menu-mode 1)                    ; Replace standard mouse-3 actions with context menu
(global-auto-revert-mode 1)              ; If file changes on disk, update the buffer automatically
(pixel-scroll-precision-mode 1)          ; Smooth scrolling
(set-scroll-bar-mode 'right)             ; Show the scrollbar and display on the right side
(display-fill-column-indicator-mode -1)  ; Don't display indicator for the fill line
(global-hl-line-mode -1)                 ; Don't highlight current line globally
(show-paren-mode 1)                      ; Show matching parens
(blink-cursor-mode 1)                    ; Blink the cursor
(tooltip-mode -1)                        ; Hide mouse hover tooltips
(global-visual-line-mode -1)             ; Wrap lines instead of extending past view
(auto-fill-mode -1)                      ; Don't auto-wrap lines
#+END_SRC

** themes
Emacs comes with several decent themes.
You can see the options by running =M-x load-theme= and then pressing =TAB=.
You will be able to see and select from the preloaded themes.
Once you've found one you like, you can add the load command to the config block.
I am partial to the native [[https://protesilaos.com/emacs/modus-themes][modus themes]].
They are accessible themes that are quite easy on the eye.
You can set the default theme to the light theme:

#+BEGIN_SRC emacs-lisp :tangle no
(load-theme 'modus-operandi t)
#+END_SRC

Or to the dark theme:

#+BEGIN_SRC emacs-lisp :tangle no :noweb-ref LOAD_THEME
(load-theme 'modus-vivendi t)
#+END_SRC

In either case there is a utility command, ~modus-themes-toggle~ which you can invoke to switch back and forth between light and dark mode.

** fonts
We can also configure the default font and line spacing:

#+BEGIN_SRC emacs-lisp :tangle no :noweb-ref SET_FONT
;; only enable font if available on system
(when (member "Unifont" (font-family-list))
  (set-frame-font "Unifont-12:regular" nil t)
  (add-to-list 'initial-frame-alist '(font . "Unifont-12:regular"))
  (add-to-list 'default-frame-alist '(font . "Unifont-12:regular")))
;; set fallback fonts for symbols and emoji
(set-fontset-font t 'symbol (font-spec :family "Apple Symbols") nil 'prepend)
(set-fontset-font t 'symbol (font-spec :family "Apple Color Emoji") nil 'prepend)
;; set line spacing (0.1 == 1x)
(setq-default line-spacing 0.1)
#+END_SRC

** rebind keys on MacOS
Finally if we are using MacOS, you may want to explicitly map the MacOS modifiers to Emacs' =meta= (Alt) and =super= (Win) keys.

#+BEGIN_SRC emacs-lisp :tangle no :noweb-ref REBIND_KEYS
(when (equal system-type 'darwin)
  (setq mac-command-modifier 'meta)
  (setq mac-option-modifier 'super))
#+END_SRC

