README.org
** backups and autosaves
Emacs's native behavior with backups, autosaves and lockfiles is quite annoying and will pollute your working directories.
Instead we can create temp directories to stores all backups and autosaves.
In addition, when editing a file in emacs, it will create a lockfile to block operating on the same file from another emacs instance.
I don't think this is a major problem since we've enabled updating the buffer if the file changes on disk.
I think is is also quite rare that you have multiple instances of Emacs open; yet alone working on the same file.

#+BEGIN_SRC emacs-lisp :tangle no :noweb-ref BACKUPS_AND_AUTOSAVES
;; write auto-saves and backups to separate directory
(make-directory "~/.tmp/emacs/auto-save/" t)
(make-directory "~/.tmp/emacs/backup/" t)
(setq auto-save-file-name-transforms '((".*" "~/.tmp/emacs/auto-save/" t)))
(setq backup-directory-alist '(("." . "~/.tmp/emacs/backup/")))

;; do not move the current file while creating backup
(setq backup-by-copying t)

;; disable lockfiles
(setq create-lockfiles nil)
#+END_SRC

** dired
Dired is Emacs' native file manager.
It is very powerful but we can slightly improve on the default interface by changing the listing format and enabling a command.
The listing flags are the same passed to =ls=.

The default navigation into subdirectories opens them in a new buffer.
If you navigate a lot, you can have a huge number of Dired buffers.
Instead we can enable ~dired-find-alternate-file~ which will allow you to press =a= in a dired buffer to open the subdirectory in your current buffer.
This is much more intuitive for users of modern file managers.

#+BEGIN_SRC emacs-lisp :tangle vanilla-init.el
(use-package dired
  :ensure nil
  :custom ((dired-listing-switches "-alh"))
  :config (put 'dired-find-alternate-file 'disabled nil))
#+END_SRC

** display-line-numbers
Some people may choose to eschew line numbers and just jump to particular lines with =M-g M-g=.
However if you like line numbers, you should include the following block to enable them in all =prog-mode= (and sub-mode) buffers:

#+BEGIN_SRC emacs-lisp :tangle vanilla-init.el
(use-package display-line-numbers
  :ensure nil
  :hook (prog-mode . display-line-numbers-mode))
#+END_SRC

** eglot
[[https://github.com/joaotavora/eglot][Eglot]] is the native [[https://microsoft.github.io/language-server-protocol/][LSP]] for Emacs v29.
Technically we don't need a configuration block for it but you could add hooks to be sure it runs in certain modes.
Alternatively you can start it up in any buffer with =M-x eglot=.

#+BEGIN_SRC emacs-lisp :tangle vanilla-init.el
(use-package eglot
  :ensure nil)
  ;;:hook (python-mode
  ;;       c-mode))
#+END_SRC

Note that =eglot= takes over built-in emacs commands.
For example when =eglot= is active it will use the built-in ~xref-find-definitions~ (=M-.=) and ~xref-find-references~ (=M-?=).
=eglot= add a few commands specific to LSP that you may want to bind for quick access:

#+BEGIN_SRC emacs-lisp :tangle no
  :bind (:map eglot-mode-map
	 ([remap display-local-help] . eldoc-doc-buffer)
	 ("C-c r" . eglot-rename)
	 ("C-c o" . eglot-code-action-organize-imports)
	 ("C-c f" . eglot-format)
	 ("C-c h" . eldoc))
#+END_SRC

If you want =eglot= to format your buffer on save, check out [[https://gist.github.com/carlosrogue/777f43b4a46400cae21aaf9ba5ca5ccc#file-gopls-eglot-el-L22][this suggestion]] by carlosrogue.
You can put the following (with hooks for the modes you want enabled) into your ~:config~ section:

#+BEGIN_SRC emacs-lisp :tangle no
  (defun eglot-format-buffer-on-save ()
    (add-hook 'before-save-hook #'eglot-format-buffer -10 t))
  (add-hook 'go-mode-hook #'eglot-format-buffer-on-save)
#+END_SRC

There are other formatters which have been nicely compared [[https://docs.google.com/document/d/1bIURUdHqlkF8QfFDnOP4ZOHXADkEtB_mbzMVoBQEBSw/edit][here]] however for most use-cases, I think you can rely on ~eglot-format-buffer~.

** flymake
Flymake is responsible for displaying warnings and errors.
You can read the [[https://www.gnu.org/software/emacs/manual/html_node/flymake/index.html#Top][docs]] but basically you can see project errors with =flymake-show-project-diagnostics= and jump between errors with =flymake-goto-prev-error= and =flymake-goto-next-error=.
These aren't bound to anything by default so you should bind them if you use them often.
Note that Flymake is run automatically by =eglot= and configured with the LSP server as the backend.
If you want to use Flymake without LSP, you'll need to look more into the docs on how to configure it for your use.

** hippie-exp
In terms of programming there are two types of completion you will likely use.
The first is completions supplied via LSP.
This can be invoked with =C-M-i=.
Alternatively if you want to use =TAB=, you could set =(setq-default tab-always-indent 'complete)= in your general config block.

For non-LSP expansion, we can use [[https://www.masteringemacs.org/article/text-expansion-hippie-expand][hippie-expand]] and replace the keymap for =dabbrev-expand= with it.
=hippie-expand= cycles through a set of possible completion functions (which can be configured of course).

#+BEGIN_SRC emacs-lisp :tangle vanilla-init.el
(use-package hippie-exp
  :ensure nil
  :bind ([remap dabbrev-expand] . hippie-expand)) ;; M-/ and C-M-/
#+END_SRC

** ibuffer
=ibuffer= is a nice replacement for the default =buffer-menu=.
We can use the =use-package= =bind= and =remap= interfaces to replace the keybinding for =buffer-menu= with =ibuffer=.

#+BEGIN_SRC emacs-lisp :tangle vanilla-init.el
(use-package ibuffer
  :ensure nil
  :bind ([remap list-buffers] . ibuffer)) ;; C-x C-b
#+END_SRC

** icomplete
Emacs has a couple completion systems.
In vanilla Emacs, =icomplete= or =icomplete-vertical= are the most sophisticated.
We can also use the [[https://www.gnu.org/software/emacs/manual/html_node/emacs/Completion-Styles.html#index-flex_002c-completion-style][flex]] completion style by default.

#+BEGIN_SRC emacs-lisp :tangle vanilla-init.el
(use-package icomplete
  :ensure nil
  ;; M-TAB is the normal keybind but often conflicts with window managers
  :bind (:map icomplete-minibuffer-map
			  ("M-j" . icomplete-force-complete))
  :init
  (icomplete-mode) ;; or icomplete-vertical-mode
  :custom
  (completion-styles '(flex basic)))
#+END_SRC

You may want to read the [[https://www.gnu.org/software/emacs/manual/html_node/emacs/Icomplete.html][docs]] on icomplete since its interface is not very modern.
The crucial commands are:

- =C-j= will select the "top" completion in the list
- =M-j= selects the "top" completion but leave it in the minibuffer; helpful for navigating file tree
- =C-,= and =C-.= can be used to rotate the list of completions
- =C-g= will cancel and exit the minibuffer (as always in Emacs)
- =TAB= will try to complete and then open the =Completions= buffer

The =Completions= buffer can be interacted with by clicking or via a set of [[https://www.gnu.org/software/emacs/manual/html_node/emacs/Completion-Commands.html][keybindings]]:

- =M-UP= and =M-DOWN= allow cycling through the =Completions= buffer while still in the minibuffer.
- =M-v= switches you from the minibuffer to the =Completions= buffer
- =q= brings you back to the minibuffer
- =TAB=/=RIGHT=/=n= and =S-TAB=/=LEFT=/=p= allow you to navigate the =Completions= buffer
- =RET= selects the current candidate

** project
Emacs has it's own way of interacting with VCS-managed projects.
You can read the [[https://www.gnu.org/software/emacs/manual/html_node/emacs/Projects.html][docs]] here but in summary there are many commands that can be run scoped to a given project with the =C-x p= prefix.
For example =C-x C-f= finds a file to open globally.
=C-x p f= finds a file in the current project.

** subword
In programming modes, we want to navigate by subword (useful in camel-case languages):

#+BEGIN_SRC emacs-lisp :tangle vanilla-init.el
(use-package subword
  :ensure nil
  :hook prog-mode)
#+END_SRC

** workflow
With that we have a very basic configuration that is somewhat modernized without any external packages.
However you will quickly see some friction tworking with this setup on a big project where you're used to the usual amenities of a modern editor.
For example, we open our large x-lang project and start to get to work fixing a bug.
We start =eglot= to interface with our LSP server.
We identify a function call that is suspect and jump to its definition with =M-.=.
We see it calls a standard library function and we can see =eldoc= prints part of its docstring in the minibuffer.
We can see the full docstring with =M-x eldoc=.
As we suspected this function was supposed to be replaced with our own implemention.
You start typing =mylib.Repla= and then press =C-M-i= to invoke completion (or =TAB= if you configured it that way).
It opens a list of options provided by the LSP at that moment in the minibuffer with =icomplete=.
You then need to pick from that list.
Further typing is not sent back to the LSP server so this completion list isn't updated till you've selected one or canceled.
This is probably the most jarring difference working with purely vanilla Emacs.

* The with-packages experience
If we relax our "no external packages" policy, we can get a much more modern UX.
We will do this incrementally so that you could chose to stop when the setup matches your needs.

** Package manager
=package.el= is the native package manager.
Since we'll be using it to install packages, we need to load and configure it first:

#+BEGIN_SRC emacs-lisp
(require 'package)
(setq package-enable-at-startup nil)
(add-to-list 'package-archives
             '("melpa" . "https://melpa.org/packages/"))

(package-initialize)
#+END_SRC

[[https://elpa.gnu.org/][ELPA]] is the official package repository but we add [[https://melpa.org/][MELPA]] as well.

Unfortunately =package.el= has a few annoying features.
First it is not declarative, so your configuration doesn't guarantee the state.
Second, it modifies your =init.el=.
After running your configuration for the first time, you'll see something like this:

#+BEGIN_SRC emacs-lisp :tangle no
(custom-set-variables
 ;; custom-set-variables was added by Custom.
 ;; If you edit it by hand, you could mess it up, so be careful.
 ;; Your init file should contain only one such instance.
 ;; If there is more than one, they won't work right.
 '(package-selected-packages
   '(minions magit corfu embark-consult embark orderless consult marginalia vertico exec-path-from-shell)))
(custom-set-faces
 ;; custom-set-faces was added by Custom.
 ;; If you edit it by hand, you could mess it up, so be careful.
 ;; Your init file should contain only one such instance.
 ;; If there is more than one, they won't work right.
 )
#+END_SRC

As the comments state, you should not modify it.
However this is very annoying if you have your config under version control.
Instead we can tell Emacs to use a separate file for customizations:

#+BEGIN_SRC emacs-lisp
(setq custom-file (concat user-emacs-directory "custom.el"))
#+END_SRC

We'll want to load that customization file at the end of this configuration.

