init.el
(require 'use-package)

(require 'package)
(setq package-enable-at-startup nil)
(add-to-list 'package-archives
             '("melpa" . "https://melpa.org/packages/"))

(package-initialize)

(setq custom-file (concat user-emacs-directory "custom.el"))

(require 'use-package)
