README.org
** Package configuration manager
We still use [[https://github.com/jwiegley/use-package][use-package]] which can also integrate with =package.el= to trigger installation of packages.
=package.el= supports installing packages from a version-controlled source.
Integration of this feature with =use-package= was merged into Emacs proper but missed the Emacs 29 release deadline.
So we install our first external package which adds support to =use-package= to manage packages in version control and not the package repositories.

#+BEGIN_SRC emacs-lisp
(require 'use-package)

(unless (package-installed-p 'vc-use-package)
  (package-vc-install "https://github.com/slotThe/vc-use-package"))
#+END_SRC

While this config doesn't actually use this feature, it is very likely you'll need to install a package like this.
For example, this is a simple configuration to install Github's [[https://github.com/features/copilot][Copilot]] plugin:

#+BEGIN_SRC emacs-lisp :tangle no
(use-package copilot
  :vc (:fetcher github :repo zerolfx/copilot.el)
  :if (eq system-type 'darwin)
  :hook (prog-mode . copilot-mode)
  :bind (:map copilot-mode-map
              ("S-<tab>" . copilot-accept-completion)
              ("S-<SPC>" . copilot-accept-completion-by-word)))
#+END_SRC

** no-littering
Emacs has a tendency to clutter the config directory.
This package tries to automagically keep things clean.
In addition, this package can handle storing backups and autosaves in a centralized directory without our manual configuration.
It should be initialized as early as possible in the configuration.

#+BEGIN_SRC emacs-lisp
(use-package no-littering
  :ensure t
  :config (no-littering-theme-backups))
#+END_SRC

** General settings
We can keep the general settings we defined previously:

#+BEGIN_SRC emacs-lisp
(use-package emacs
  :config
  (setq-default
   coding-system-for-read 'utf-8     ; Use UTF-8 by default
   coding-system-for-write 'utf-8
   cursor-in-non-selected-windows t  ; Don't hide the cursor in inactive windows
   help-window-select t              ; Focus new help windows when opened
   indent-tabs-mode -1               ; Use spaces by default instead of tabs
   tab-width 4                       ; Set width for tabs
   indicate-empty-lines t            ; Display bitmap in left fringe on empty lines
   indicate-buffer-boundaries 'left  ; Indicate last newline in buffer
   require-final-newline t           ; Always insert final newline on save
   show-trailing-whitespace t        ; Highlight trailing whitespace at end of line
   inhibit-startup-screen t          ; Remove default start screen
   select-enable-clipboard t         ; Merge Emacs and system clipboard
   view-read-only t                  ; Always open read-only buffers in view-mode
   visible-bell t                    ; Use a visual bell
   vc-follow-symlinks t              ; Don't ask for confirmation following symlinked files
   sentence-end-double-space nil     ; Sentences end with punctuation and a single space
   show-paren-delay 0)               ; No delay on highlighting matching paren

  (fset 'yes-or-no-p 'y-or-n-p)  ; Replace yes/no prompts with y/n

  ;; global modes
  (column-number-mode 1)                   ; Show the column number in modeline
  (tool-bar-mode 1)                        ; Show the toolbar
  (menu-bar-mode 1)                        ; Show the menubar
  (context-menu-mode 1)                    ; Replace standard mouse-3 actions with context menu
  (global-auto-revert-mode 1)              ; If file changes on disk, update the buffer automatically
  (pixel-scroll-precision-mode 1)          ; Smooth scrolling
  (set-scroll-bar-mode 'right)             ; Show the scrollbar and display on the right side
  (display-fill-column-indicator-mode -1)  ; Don't display indicator for the fill line
  (global-hl-line-mode -1)                 ; Don't highlight current line globally
  (show-paren-mode 1)                      ; Show matching parens
  (blink-cursor-mode 1)                    ; Blink the cursor
  (tooltip-mode -1)                        ; Hide mouse hover tooltips
  (global-visual-line-mode -1)             ; Wrap lines instead of extending past view
  (auto-fill-mode -1)                      ; Don't auto-wrap lines

  ;; load theme
  (load-theme 'modus-vivendi t)

  ;; only enable font if available on system
  (when (member "Unifont" (font-family-list))
    (set-frame-font "Unifont-12:regular" nil t)
    (add-to-list 'initial-frame-alist '(font . "Unifont-12:regular"))
    (add-to-list 'default-frame-alist '(font . "Unifont-12:regular")))
  ;; set fallback fonts for symbols and emoji
  (set-fontset-font t 'symbol (font-spec :family "Apple Symbols") nil 'prepend)
  (set-fontset-font t 'symbol (font-spec :family "Apple Color Emoji") nil 'prepend)
  ;; set line spacing (0.1 == 1x)
  (setq-default line-spacing 0.1)

  ;; rebind keys on MacOS
  (when (equal system-type 'darwin)
  (setq mac-command-modifier 'meta)
  (setq mac-option-modifier 'super))

    ;; disable lockfiles
  (setq create-lockfiles nil))
#+END_SRC

** corfu
[[https://github.com/minad/corfu]]

This package provides a completion popup which integrates with LSP and emacs' built-in completion interfaces.
It doesn't require any special configuration (although there are many options available).
This solves the main workflow issue mentioned above in the vanilla configuration.

#+BEGIN_SRC emacs-lisp
(use-package corfu
  :ensure t
  :init
  (global-corfu-mode))
#+END_SRC

*** kind-icon
[[https://github.com/jdtsmith/kind-icon]]

If you want to add icons to =corfu=, you could install and setup =kind-icon= for this:

#+BEGIN_SRC emacs-lisp :tangle no
(use-package kind-icon
  :ensure t
  :after corfu
  :custom
  (kind-icon-default-face 'corfu-default) ; to compute blended backgrounds correctly
  :config
  (add-to-list 'corfu-margin-formatters #'kind-icon-margin-formatter))
#+END_SRC

** dired
#+BEGIN_SRC emacs-lisp
(use-package dired
  :ensure nil
  :custom ((dired-listing-switches "-alh"))
  :config (put 'dired-find-alternate-file 'disabled nil))
#+END_SRC

** display-line-numbers
#+BEGIN_SRC emacs-lisp
(use-package display-line-numbers
  :ensure nil
  :hook (prog-mode . display-line-numbers-mode))
#+END_SRC

** dumb jump
This package uses =grep=, =The Silver Searcher= or =ripgrep= along with some baked language heuristics to implement a fast go-to-definiton command.
LSP should usually handle this functionality but =dumb-jump= is a solid fallback that just works without configuration.

#+BEGIN_SRC emacs-lisp
(use-package dumb-jump
  :ensure t
  :after xref
  :custom (dumb-jump-force-searcher 'rg)
  :config (add-hook 'xref-backend-functions #'dumb-jump-xref-activate))
#+END_SRC

** eglot
#+BEGIN_SRC emacs-lisp
(use-package eglot
  :ensure nil)
  ;;:hook (python-mode
  ;;       c-mode))
#+END_SRC

** exec-path-from-shell
[[https://github.com/purcell/exec-path-from-shell]]

This package ensures the shell environment variables are also present in Emacs.
This is often an issue on MacOS and can be quite frustrating for a new user.

#+BEGIN_SRC emacs-lisp
(use-package exec-path-from-shell
  :ensure t
  :init
  (when (memq window-system '(mac ns x))
    (exec-path-from-shell-initialize)))
#+END_SRC

** flymake

** hippie-exp
#+BEGIN_SRC emacs-lisp
(use-package hippie-exp
  :ensure nil
  :bind ([remap dabbrev-expand] . hippie-expand)) ;; M-/ and C-M-/
#+END_SRC

** ibuffer
#+BEGIN_SRC emacs-lisp
(use-package ibuffer
  :ensure nil
  :bind ([remap list-buffers] . ibuffer)) ;; C-x C-b
#+END_SRC

** magit
[[https://magit.vc/]]

Emacs already has several features built-in for version control.
If you're using git most of the time, consider using =magit= which a very powerful git porcelain.

#+BEGIN_SRC emacs-lisp
(use-package magit
  :ensure t)
#+END_SRC

** minions
[[https://github.com/tarsius/minions]]

You may have noticed that the mode line can become very cluttered as various modes and minor modes compete for space.
Most of the time, you don't care for a particular minor mode indicator.
There are a several packages that allow you configure how modes are displayed or hidden:

- [[https://github.com/myrjola/diminish.el][diminish.el]]
- [[https://elpa.gnu.org/packages/delight.html][delight.el]]
- [[https://github.com/alezost/dim.el][dim.el]]
- [[https://github.com/radian-software/blackout][blackout.el]]

These all require you to configure the display for each package.
=minions.el= is much simpler to configure.
It assumes by default that you do **not** want to see minor modes and hides them in a =;-)= menu.
You can define modes that you want to be excluded from that blanket assumption.

#+BEGIN_SRC emacs-lisp
(use-package minions
  :ensure t
  :init
  (minions-mode 1)
  :custom
  (minions-prominent-modes '(flymake-mode)))
#+END_SRC

=flymake-mode= is a example of a minor mode that display helpful information in the mode line.
It shows the number of errors and warnings in the buffer.
We can just add it as a member of the ~minions-prominent-modes~ so it is always displayed when active.

** project

** subword
#+BEGIN_SRC emacs-lisp
(use-package subword
  :ensure nil
  :hook prog-mode)
#+END_SRC

** vundo
[[https://github.com/casouri/vundo]]

Emacs has a powerful [[https://www.gnu.org/software/emacs/manual/html_node/emacs/Undo.html][undo system]] but it can be very hard to keep track of the undo state.
=vundo.el= solves this by providing a visual interface to the built-in undo system.

#+BEGIN_SRC emacs-lisp
(use-package vundo
  :ensure t
  :bind ("C-c u" . vundo))
#+END_SRC

** Browse remote code
It can be helpful to jump directly to hosted remote code from your local
checkout.

#+BEGIN_SRC emacs-lisp
(use-package browse-at-remote
  :ensure t
  :bind ("C-c g g" . browse-at-remote))
#+END_SRC

#+RESULTS:
: browse-at-remote

** Improved completions
We can install a family of packages that will greatly modernize completions over =icomplete= et al.

*** vertico
[[https://github.com/minad/vertico]]

=vertico.el= is faithful to basic emacs behavior but has a nicer interface.
In particular (as the name suggests), it displays options vertically as opposed to most of emacs' built-ins which display them horizontally.
Several competant Emacs users still rely on =icomplete= but I am more productive with =vertico= and I suspect most users new to Emacs will be as well.

#+BEGIN_SRC emacs-lisp
(use-package vertico
  :ensure t
  :init
  (vertico-mode))
#+END_SRC

*** marginalia
[[https://github.com/emacs-straight/marginalia]]

=marginalia.el= adds additional information adjacent to minibuffer completions.

#+BEGIN_SRC emacs-lisp
(use-package marginalia
  :ensure t
  :bind (:map minibuffer-local-map
              ("M-A" . marginalia-cycle))
  :init
  (marginalia-mode))
#+END_SRC

