README.org
*** consult
[[https://github.com/minad/consult]]

=consult.el= provides many helpful commands to replace the built-ins.
In addition it has some new commands as well.
The example =consult= configuration in their documentation is quite large but I've distilled it down to something smaller for this configuration.
As you gain experience you can add more functionality to suit your needs.

#+BEGIN_SRC emacs-lisp
(use-package consult
  :ensure t
  :bind (([remap switch-to-buffer] . consult-buffer)
         ([remap switch-to-buffer-other-window] . consult-buffer-other-window)
         ([remap switch-to-buffer-other-frame] . consult-buffer-other-frame)
         ([remap bookmark-jump] . consult-bookmark)
         ([remap project-switch-to-buffer] . consult-project-buffer)
         ([remap yank-pop] . consult-yank-pop)
         :map isearch-mode-map
         ([remap isearch-edit-string] . consult-isearch-history)
         ("C-c l" . consult-line)
         ("C-c L" . consult-line-multi)
         :map minibuffer-local-map
         ([remap next-matching-history-element] . consult-history)
         ([remap previous-matching-history-element] . consult-history)))
#+END_SRC

*** orderless
[[https://github.com/oantolin/orderless]]

The built-in completion styles are fine but once you've used =orderless= you will find any other completion style clunky.
=orderless= implements a space separated regex completion.
As with everything in Emacs, this can be customed but the default works well.

#+BEGIN_SRC emacs-lisp
(use-package orderless
  :ensure t
  :custom
  (completion-styles '(orderless basic))
  (completion-category-defaults nil)
  (completion-category-overrides '((file (styles . (partial-completion))))))
#+END_SRC

** Load the customization file
Now at the end of the config we can load the customization file:

#+BEGIN_SRC emacs-lisp
(load custom-file)
#+END_SRC

* Managing keybindings
Emacs has a *lot* of keybindings.
You'll learn common operations (switching buffers and opening files) quickly.
For operations that you perform very infrequently, the =M-x= command menu works well as a command palette.
However I find there are a couple issues you'll face with this system.
This is by no means unique to emacs but it is more apparent in emacs since every possible operation is a function.
First a command palette only has value if you know roughly what you are searching for.
It isn't a great medium for discovery.
If you've never used an LSP client, you won't know to search for ~eglot-format-buffer~ when you want LSP-powered formatting.
However, it not feasible to bind every operation to a keybinding or to remember all those bindings.

The alternative is contextual keybindings.
Emacs already has this to some extent since keys are bound based on the active modes.
You can even add discoverability to this using something like [[https://github.com/justbur/emacs-which-key][which-key]].
This is a simple approach but has a few flaws.
For one, *all* available keybindings are displayed in an unorganized way.
This leads to cluttered view and it isn't easy to quickly find an operation you actually care about.
In addition you still need to use one of the keybindings available in the standard [[https://www.gnu.org/software/emacs/manual/html_node/elisp/Key-Binding-Conventions.html][keybinding conventions]] for every operation.

With a little more work, we can create contextual keybindings with better menu's and fewer keybindings.
There are two solutions: [[https://github.com/abo-abo/hydra][hydra]] and [[https://github.com/magit/transient][transient]].
Both are very similar and support all the features I find important.
=Hydra= uses colored letters to indicate how the letters will affect the hydra menu.
For example a =blue= key will exit the menu after running, a =red= key will keep it open, etc.
In addition, hydras gives you a lot of control over formatting (at least the parent hydra) so you can have keys layed out in a navigational pattern for example.
=Transient= is less flexible in terms of the display but supports infix commands natively.
This means it is great for creating interfaces to CLI commands where you might want to enable a flag while running a command (it was designed for the [[https://magit.vc/][magit]] git client after all).
I actually prefer =Transient= because it's less flexible layout means you can more easily add additional commands to a previously defined prefix.
Adding additional options to a hydra using a =hydra+= means the additional commands lie outside your prior defined formatting.
I've also faced a few bugs in hydra with certain commands that I don't experience in transient.
Unfortunately transient is a complex project and was not designed initially as a user-configuration tool.
The documentation is more dense.
